### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_scheduled_query_rules_alert_v2.auth-events will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "auth-events" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Failure(s) detected on ServiceBus Authentication Event emission. See https://pagopa.atlassian.net/wiki/spaces/IAEI/pages/1859846279/Fallimento+emissione+evento+di+Log-Out"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH] ServiceBus Log-Out Event(s) emission failure(s)"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                customEvents
                | where name == "service-bus.auth-event.emission-failure"
                | extend eventData = parse_json(tostring(customDimensions.eventData))
                | where eventData.eventType == "logout""
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.azure-service-bus-alerts.azurerm_monitor_metric_alert.active[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "active" {
      ~ frequency                = "PT1M" -> "PT5M"
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-auth-io-p-itn-platform-sbns-01-sbns-act-ma-01"
        name                     = "io-p-itn-auth-io-p-itn-platform-sbns-01-sbns-act-ma-01"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "ModuleName"     = "azure_service_bus_alerts"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.2" -> "0.1.3"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/EC285037-C673-4F58-B594-D7C480DA4E8B/resourceGroups/io-p-itn-auth-common-rg-01/providers/microsoft.insights/actionGroups/io-p-itn-auth-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01"
        }

      ~ criteria {
          ~ threshold              = 10 -> 5000
            # (5 unchanged attributes hidden)

          ~ dimension {
                name     = "EntityName"
              ~ values   = [
                  ~ "*" -> "io-auth-sessions-topic",
                ]
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.azure-service-bus-alerts.azurerm_monitor_metric_alert.dlq[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "dlq" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-auth-io-p-itn-platform-sbns-01-sbns-dlq-ma-01"
        name                     = "io-p-itn-auth-io-p-itn-platform-sbns-01-sbns-dlq-ma-01"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "ModuleName"     = "azure_service_bus_alerts"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.2" -> "0.1.3"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.io_platform_apim_api_itn.module.bpd_api_session_manager.azurerm_api_management_api.this will be updated in-place
  ~ resource "azurerm_api_management_api" "this" {
      + description           = "Auth & Identity Session Manager BPD API"
      ~ display_name          = "Bonus Pagamenti Digitali API for user authentication." -> "IO SESSION MANAGER BPD API"
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-session-manager-bpd-api-v1;rev=1"
        name                  = "io-session-manager-bpd-api-v1"
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.io_platform_apim_api_itn.module.external_api_session_manager.azurerm_api_management_api.this will be updated in-place
  ~ resource "azurerm_api_management_api" "this" {
      + description           = "Auth & Identity Session Manager External API"
      ~ display_name          = "Collection of exposed endpoints to interact with user's auth session." -> "IO SESSION MANAGER EXTERNAL API"
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-session-manager-external-api-v1;rev=1"
        name                  = "io-session-manager-external-api-v1"
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.io_platform_apim_api_itn.module.fims_api_session_manager.azurerm_api_management_api.this will be updated in-place
  ~ resource "azurerm_api_management_api" "this" {
      + description           = "Auth & Identity Session Manager Fims API"
      ~ display_name          = "Federated Identity Management System API for user authentication." -> "IO SESSION MANAGER FIMS API"
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-session-manager-fims-api-v1;rev=1"
        name                  = "io-session-manager-fims-api-v1"
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.io_platform_apim_api_itn.module.pagopa_api_session_manager.azurerm_api_management_api.this will be updated in-place
  ~ resource "azurerm_api_management_api" "this" {
      + description           = "Auth & Identity Session Manager Pagopa API"
      ~ display_name          = "Mobile and web proxy API gateway." -> "IO SESSION MANAGER PAGOPA API"
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-session-manager-pagopa-api-v1;rev=1"
        name                  = "io-session-manager-pagopa-api-v1"
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.io_platform_apim_api_itn.module.zendesk_api_session_manager.azurerm_api_management_api.this will be updated in-place
  ~ resource "azurerm_api_management_api" "this" {
      + description           = "Auth & Identity Session Manager Zendesk API"
      ~ display_name          = "User authentication for zendesk" -> "IO SESSION MANAGER ZENDESK API"
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-session-manager-zendesk-api-v1;rev=1"
        name                  = "io-session-manager-zendesk-api-v1"
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 7 to change, 0 to destroy.
```

</details>
